In [1]:
import pandas as pd

In [ ]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}
data
df=pd.DataFrame(data)
#rename temporarily
df.rename(columns={'Name':'Full Name','Age':'Age in Years','City':'City of Residence'})
#rename permanently
df.rename(columns={'Name':'Full Name','Age':'Age in Years','City':'City of Residence'},inplace=1)
print(df)

  Full Name  Age in Years City of Residence
0     Alice            24          New York
1       Bob            27       Los Angeles
2   Charlie            22           Chicago
3     David            32           Houston

In [11]:
#CREATE 4d array
array_4d = pd.DataFrame({
    'A': [[[[1, 2], [3, 4]], [[5, 6], [7, 8]]],
          [[[9, 10], [11, 12]], [[13, 14], [15, 16]]]],
    'B': [[[[17, 18], [19, 20]], [[21, 22], [23, 24]]],
          [[[25, 26], [27, 28]], [[29, 30], [31, 32]]]]
})
print(array_4d)
df=pd.DataFrame(array_4d)
print(df)

                                             A  \
0         [[[1, 2], [3, 4]], [[5, 6], [7, 8]]]
1  [[[9, 10], [11, 12]], [[13, 14], [15, 16]]]

                                              B
0  [[[17, 18], [19, 20]], [[21, 22], [23, 24]]]
1  [[[25, 26], [27, 28]], [[29, 30], [31, 32]]]
                                             A  \
0         [[[1, 2], [3, 4]], [[5, 6], [7, 8]]]
1  [[[9, 10], [11, 12]], [[13, 14], [15, 16]]]

                                              B
0  [[[17, 18], [19, 20]], [[21, 22], [23, 24]]]
1  [[[25, 26], [27, 28]], [[29, 30], [31, 32]]]

In [12]:
#create a 4 dimensional array
array_4d=[[[[1,2],[3,4]],[[5,6],[7,8]]],[[[9,10],[11,12]],[[13,14],[15,16]]]]
df=pd.DataFrame(array_4d,columns=['A','B'],index=['C','D'])
print(df)

                     A                     B
C     [[1, 2], [3, 4]]      [[5, 6], [7, 8]]
D  [[9, 10], [11, 12]]  [[13, 14], [15, 16]]

In [19]:
df

  Full Name  Age in Years City of Residence
0     Alice            24          New York
1       Bob            27       Los Angeles
2   Charlie            22           Chicago
3     David            32           Houston

In [36]:
#step3: load datasets from system
df=pd.read_csv("C:\\practise\\dataset.csv")
print(df)

      age  sex  cp  trestbps  chol  fbs  restecg  thalach  exang  oldpeak  \
0     NaN    1   3       145   233    1        0      150      0      2.3
1    37.0    1   2       130   250    0        1      187      0      3.5
2     NaN    0   1       130   204    0        0      172      0      1.4
3     NaN    1   1       120   236    0        1      178      0      0.8
4    57.0    0   0       120   354    0        1      163      1      0.6
..    ...  ...  ..       ...   ...  ...      ...      ...    ...      ...
298  57.0    0   0       140   241    0        1      123      1      0.2
299  45.0    1   3       110   264    0        1      132      0      1.2
300  68.0    1   0       144   193    1        1      141      0      3.4
301  57.0    1   0       130   131    0        1      115      1      1.2
302  57.0    0   1       130   236    0        0      174      0      0.0

     slope  ca  thal  target
0        0   0     1       1
1        0   0     2       1
2        2   0     2       1
3        2   0     2       1
4        2   0     2       1
..     ...  ..   ...     ...
298      1   0     3       0
299      1   0     3       0
300      1   2     3       0
301      1   1     3       0
302      1   1     2       0

[303 rows x 14 columns]

In [27]:
df.sample(5)
df.sample()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
271,61,1,3,134,234,0,1,145,0,2.6,1,2,2,0

In [28]:
#method 5:info() method
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       303 non-null    int64
 1   sex       303 non-null    int64
 2   cp        303 non-null    int64
 3   trestbps  303 non-null    int64
 4   chol      303 non-null    int64
 5   fbs       303 non-null    int64
 6   restecg   303 non-null    int64
 7   thalach   303 non-null    int64
 8   exang     303 non-null    int64
 9   oldpeak   303 non-null    float64
 10  slope     303 non-null    int64
 11  ca        303 non-null    int64
 12  thal      303 non-null    int64
 13  target    303 non-null    int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [29]:
#method 6: describe() method
df.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [32]:
#method 7:find missing values
df.isnull()
df.isnull().sum()
df.isna().sum()

age         0
sex         0
cp          0
trestbps    0
chol        0
fbs         0
restecg     0
thalach     0
exang       0
oldpeak     0
slope       0
ca          0
thal        0
target      0
dtype: int64

In [34]:
#method 8:value_counts() method
df['target'].value_counts()

target
1    165
0    138
Name: count, dtype: int64

In [35]:
#meyhod 9:shape method
df.shape

(303, 14)

In [40]:
#handle missing values
df['age'].fillna(0)

0      54.376667
1      37.000000
2      54.376667
3      54.376667
4      57.000000
         ...
298    57.000000
299    45.000000
300    68.000000
301    57.000000
302    57.000000
Name: age, Length: 303, dtype: float64

In [41]:
#method 11: sort_values() method
df.sort_values(by='age',ascending=True)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
72,29.0,1,1,130,204,0,0,202,0,0.0,2,0,2,1
125,34.0,0,1,118,210,0,1,192,0,0.7,2,0,2,1
58,34.0,1,3,118,182,0,0,174,0,0.0,2,0,2,1
239,35.0,1,0,126,282,0,0,156,1,0.0,2,0,3,0
65,35.0,0,0,138,183,0,1,182,0,1.4,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25,71.0,0,1,160,302,0,1,162,0,0.4,2,2,2,1
151,71.0,0,0,112,149,0,1,125,0,1.6,1,0,2,1
129,74.0,0,1,120,269,0,0,121,1,0.2,2,1,2,1
144,76.0,0,2,140,197,0,2,116,0,1.1,1,0,2,1
238,77.0,1,0,125,304,0,0,162,1,0.0,2,3,2,0

In [44]:
df.groupby('sex')['age'].mean()

sex
0    55.816424
1    53.708953
Name: age, dtype: float64

In [45]:
#method 13: iloc[] method
df.iloc[0:5,0:3]

         age  sex  cp
0  54.376667    1   3
1  37.000000    1   2
2  54.376667    0   1
3  54.376667    1   1
4  57.000000    0   0

In [46]:
#method 14: loc[] method
df.loc[0:5,['age','sex']]

         age  sex
0  54.376667    1
1  37.000000    1
2  54.376667    0
3  54.376667    1
4  57.000000    0
5  57.000000    1

In [48]:
df.dtypes

age         float64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

In [56]:
#method 15: astype() method
df['oldpeak']=df['oldpeak'].astype('int32')
df['oldpeak'].dtype

dtype('int32')

In [ ]:
#method 16: unique() method
#all columns unique values
df['sex'].unique()

array([1, 0])

In [58]:
#method 17:nunique() method
df['cp'].nunique()

4

In [63]:
#no of values whose age is greater than 20 less than 50
a=df[(df['age']>20) & (df['age']<50)]
len(a)

87

In [62]:
#display data whose age is greater than 20 less than 50
df[(df['age']>20) & (df['age']<50)]

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
1,37,1,2,130,250,0,1,187,0,3,0,0,2,1
7,44,1,1,120,263,0,1,173,0,0,2,0,3,1
11,48,0,2,130,275,0,1,139,0,0,2,0,2,1
12,49,1,1,130,266,0,1,171,0,0,2,0,2,1
18,43,1,0,150,247,0,1,171,0,1,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
280,42,1,0,136,315,0,1,125,1,1,1,0,1,0
283,40,1,0,152,223,0,1,181,0,0,2,0,3,0
285,46,1,0,140,311,0,1,120,1,1,1,2,3,0
294,44,1,0,120,169,0,1,144,1,2,0,0,1,0
299,45,1,3,110,264,0,1,132,0,1,1,0,3,0

In [69]:
#check chol values and print values if greater than 200 high cholesterol print high otherwise low without lambda function 
def cholesterol_level(chol):
    if chol > 200:
        return 'High Cholesterol'
    else:
        return 'Low Cholesterol'
df['cholesterol_level'] = df['chol'].apply(cholesterol_level)
df[['chol', 'cholesterol_level']]

     chol cholesterol_level
0     233  High Cholesterol
1     250  High Cholesterol
2     204  High Cholesterol
3     236  High Cholesterol
4     354  High Cholesterol
..    ...               ...
298   241  High Cholesterol
299   264  High Cholesterol
300   193   Low Cholesterol
301   131   Low Cholesterol
302   236  High Cholesterol

[303 rows x 2 columns]

In [ ]:
#method : 18 using merge function
df1 = pd.DataFrame({
    'patient_id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie']
})  
df2 = pd.DataFrame({
    'patient_id': [1, 2, 4],
    'age': [25, 30, 35]
})  
merged_df = pd.merge(df1, df2, on='patient_id', how='inner')
merged_df

   patient_id   name  age
0           1  Alice   25
1           2    Bob   30

In [ ]:
#method 19:save saved dataset
df.to_csv("C:\\practise\\new_dataset.csv", index=False)

In [ ]:
#method 20:check for duplicate values
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
298    False
299    False
300    False
301    False
302    False
Length: 303, dtype: bool

In [74]:
df=pd.read_csv(r"C:\practise\messy_employee_dataset_1000_rows.csv")
print(df)

      user_id      age     salary department   join_date       city  \
0      user_0       -5     ₹50000         HR  2020/12/01      DELHI
1       U1001       30      45000    Finance  15/02/2021      Delhi
2       U1002       30      25000         HR         NaN      Delhi
3         NaN  unknown        NaN         HR     invalid  Hyderabad
4         NaN      NaN  120000.75         IT         NaN      DELHI
..        ...      ...        ...        ...         ...        ...
995       NaN       60     ₹50000         HR  15/02/2021      DELHI
996     U1996      NaN        NaN         IT  15/02/2021     Mumbai
997  user_997  unknown      25000         HR     invalid     Mumbai
998     U1998       -5      25000        NaN  15/02/2021  Bangalore
999       NaN       30      45000         HR  2022-01-15  Hyderabad

    performance_score experience_years is_active
0                   3             five      True
1                   3                1       yes
2           excellent               10     False
3           excellent                5       yes
4                 NaN               -1     False
..                ...              ...       ...
995                 2             five       NaN
996               NaN                5        no
997                 3                5      True
998                 1                0      True
999         excellent             five        no

[1000 rows x 9 columns]

In [75]:
df.shape

(1000, 9)

In [76]:
#display columns of dataset
df.columns  
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [77]:
df.dtypes

user_id              object
age                  object
salary               object
department           object
join_date            object
city                 object
performance_score    object
experience_years     object
is_active            object
dtype: object

In [78]:
#calculate the percentage of missing values in each column
missing_percentage = df.isnull().mean() * 100   
print(missing_percentage)

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

In [79]:
#identify columns containing mixed data types
for column in df.columns:
    if df[column].apply(type).nunique() > 1:
        print(f"Column '{column}' contains mixed data types.")

Column 'user_id' contains mixed data types.
Column 'age' contains mixed data types.
Column 'salary' contains mixed data types.
Column 'department' contains mixed data types.
Column 'join_date' contains mixed data types.
Column 'city' contains mixed data types.
Column 'performance_score' contains mixed data types.
Column 'experience_years' contains mixed data types.
Column 'is_active' contains mixed data types.

In [88]:
#clean user_id by replacing empty strings with NaN and converting values to uppercase without numpy as np
df['user_id'] = df['user_id'].replace('', pd.NA).str.upper()
df['user_id']
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,NaN,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000.00,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000.00,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,NaN,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,NaN,25000.00,HR,invalid,Mumbai,3,5,True
998,U1998,NaN,25000.00,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000.00,HR,2022-01-15,Hyderabad,excellent,five,no

In [89]:
#convert age to numeric and replace invalid values(negative or >100) with NaN
df['age'] = pd.to_numeric(df['age'], errors='coerce')
df['age'] = df['age'].where((df['age'] >= 0) & (df['age'] <= 100), np.nan)  
df['age']
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,NaN,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000.00,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000.00,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,NaN,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,NaN,25000.00,HR,invalid,Mumbai,3,5,True
998,U1998,NaN,25000.00,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000.00,HR,2022-01-15,Hyderabad,excellent,five,no

In [90]:
#clean salary by removing currency symbols and commas, then converting it to numeric
df['salary'] = df['salary'].replace('[\$,]', '', regex=True)
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')
df['salary']
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,NaN,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000.00,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000.00,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,NaN,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,NaN,25000.00,HR,invalid,Mumbai,3,5,True
998,U1998,NaN,25000.00,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000.00,HR,2022-01-15,Hyderabad,excellent,five,no

In [91]:
# Display the first few rows of the DataFrame
print(df.head())

  user_id   age     salary department   join_date       city  \
0  USER_0   NaN        NaN         HR  2020/12/01      DELHI
1   U1001  30.0   45000.00    Finance  15/02/2021      Delhi
2   U1002  30.0   25000.00         HR         NaN      Delhi
3     NaN   NaN        NaN         HR     invalid  Hyderabad
4     NaN   NaN  120000.75         IT         NaN      DELHI

  performance_score experience_years is_active
0                 3             five      True
1                 3                1       yes
2         excellent               10     False
3         excellent                5       yes
4               NaN               -1     False

In [94]:
#convert join date into datetime format handling multiple date formats
df['join_date'] = pd.to_datetime(df['join_date'], errors='coerce', infer_datetime_format=True)
df['join_date']
df

C:\Users\Dolly\AppData\Local\Temp\ipykernel_7548\2717825390.py:2: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  df['join_date'] = pd.to_datetime(df['join_date'], errors='coerce', infer_datetime_format=True)

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,NaN,HR,2020-12-01,DELHI,3,five,True
1,U1001,30.0,45000.00,Finance,NaT,Delhi,3,1,yes
2,U1002,30.0,25000.00,HR,NaT,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,NaT,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaT,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,NaN,HR,NaT,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5,no
997,USER_997,NaN,25000.00,HR,NaT,Mumbai,3,5,True
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1,0,True
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,excellent,five,no

In [96]:
#extract joining year from cleaned join_date
df['joining_year'] = df['join_date'].dt.year
df[['joining_year']]

     joining_year
0          2020.0
1             NaN
2             NaN
3             NaN
4             NaN
..            ...
995           NaN
996           NaN
997           NaN
998           NaN
999           NaN

[1000 rows x 1 columns]

In [105]:
#standardize the 'department' values by trimming spaces and converting to uppercase
df['department'] = df['department'].str.strip().str.upper()
df['department']=df['department'].replace({'IT':'INFORMATION TECHNOLOGY','HR':'HUMAN RESOURCES','FINANCE':'FINANCIALS'})
df[['department']]
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year,performance_score_numeric
0,USER_0,NaN,NaN,HUMAN RESOURCES,2020-12-01,New Delhi,3,five,True,2020.0,NaN
1,U1001,30.0,45000.00,FINANCIALS,NaT,New Delhi,3,1,yes,NaN,NaN
2,U1002,30.0,25000.00,HUMAN RESOURCES,NaT,New Delhi,excellent,10,False,NaN,NaN
3,NaN,NaN,NaN,HUMAN RESOURCES,NaT,Secunderabad,excellent,5,yes,NaN,NaN
4,NaN,NaN,120000.75,INFORMATION TECHNOLOGY,NaT,New Delhi,NaN,-1,False,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,NaN,HUMAN RESOURCES,NaT,New Delhi,2,five,NaN,NaN,NaN
996,U1996,NaN,NaN,INFORMATION TECHNOLOGY,NaT,Mumbai City,NaN,5,no,NaN,NaN
997,USER_997,NaN,25000.00,HUMAN RESOURCES,NaT,Mumbai City,3,5,True,NaN,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1,0,True,NaN,NaN
999,NaN,30.0,45000.00,HUMAN RESOURCES,NaT,Secunderabad,excellent,five,no,NaN,NaN

In [104]:
#normalize city names to a consistent case and spelling
df['city'] = df['city'].str.strip().str.title()
df['city']=df['city'].replace({'Delhi':'New Delhi','Hyderabad':'Secunderabad','Banglore':'Bengaluru','Mumbai':'Mumbai City'})
df[['city']]
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year,performance_score_numeric
0,USER_0,NaN,NaN,HR,2020-12-01,New Delhi,3,five,True,2020.0,NaN
1,U1001,30.0,45000.00,FINANCE,NaT,New Delhi,3,1,yes,NaN,NaN
2,U1002,30.0,25000.00,HR,NaT,New Delhi,excellent,10,False,NaN,NaN
3,NaN,NaN,NaN,HR,NaT,Secunderabad,excellent,5,yes,NaN,NaN
4,NaN,NaN,120000.75,IT,NaT,New Delhi,NaN,-1,False,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,NaN,HR,NaT,New Delhi,2,five,NaN,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai City,NaN,5,no,NaN,NaN
997,USER_997,NaN,25000.00,HR,NaT,Mumbai City,3,5,True,NaN,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1,0,True,NaN,NaN
999,NaN,30.0,45000.00,HR,NaT,Secunderabad,excellent,five,no,NaN,NaN

In [103]:
#convert performance score into numeric by mapping text values to numbers
performance_mapping = {
    'Excellent': 5,
    'Good': 4,
    'Average': 3,
    'Poor': 2,
    'Very Poor': 1
}
df['performance_score_numeric'] = df['performance_score'].map(performance_mapping)
df[['performance_score', 'performance_score_numeric']]
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year,performance_score_numeric
0,USER_0,NaN,NaN,HR,2020-12-01,Delhi,3,five,True,2020.0,NaN
1,U1001,30.0,45000.00,FINANCE,NaT,Delhi,3,1,yes,NaN,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,excellent,10,False,NaN,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,excellent,5,yes,NaN,NaN
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,-1,False,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,NaN,HR,NaT,Delhi,2,five,NaN,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5,no,NaN,NaN
997,USER_997,NaN,25000.00,HR,NaT,Mumbai,3,5,True,NaN,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1,0,True,NaN,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,excellent,five,no,NaN,NaN

In [108]:
#clean experience years by converting text values to numeric and remove negative values
def convert_experience(exp):
    try:
        years = int(exp)
        return years if years >= 0 else pd.NA
    except:
        return pd.NA
df['experience_years'] = df['experience_years'].apply(convert_experience)
df['experience_years']

0      <NA>
1         1
2        10
3         5
4      <NA>
       ...
995    <NA>
996       5
997       5
998       0
999    <NA>
Name: experience_years, Length: 1000, dtype: object

In [113]:
#convert is_active values to yes/no true/false boolean format 
def convert_is_active(val):
    val = str(val).strip().lower()
    if val in ['yes', 'true', '1']:
        return True
    elif val in ['no', 'false', '0']:
        return False
    else:
        return pd.NA
df['is_active'] = df['is_active'].apply(convert_is_active)
df['is_active']

0       True
1       True
2      False
3       True
5      False
       ...
990    False
991     True
996    False
997     True
998     True
Name: is_active, Length: 491, dtype: object

In [115]:
#identify and remove duplicate records based on user_id
df['no_dup']=df.drop_duplicates(subset=['user_id'], inplace=True)
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year,performance_score_numeric,no_dup
0,USER_0,NaN,NaN,HUMAN RESOURCES,2020-12-01,New Delhi,3,<NA>,True,2020.0,NaN,None
1,U1001,30.0,45000.0,FINANCIALS,NaT,New Delhi,3,1,True,NaN,NaN,None
2,U1002,30.0,25000.0,HUMAN RESOURCES,NaT,New Delhi,excellent,10,False,NaN,NaN,None
3,NaN,NaN,NaN,HUMAN RESOURCES,NaT,Secunderabad,excellent,5,True,NaN,NaN,None
5,USER_5,NaN,25000.0,INFORMATION TECHNOLOGY,NaT,NaN,3,0,False,NaN,NaN,None
...,...,...,...,...,...,...,...,...,...,...,...,...
990,U1990,NaN,NaN,SALES,NaT,Secunderabad,NaN,<NA>,False,NaN,NaN,None
991,U1991,45.0,NaN,HUMAN RESOURCES,NaT,Mumbai City,NaN,<NA>,True,NaN,NaN,None
996,U1996,NaN,NaN,INFORMATION TECHNOLOGY,NaT,Mumbai City,NaN,5,False,NaN,NaN,None
997,USER_997,NaN,25000.0,HUMAN RESOURCES,NaT,Mumbai City,3,5,True,NaN,NaN,None
998,U1998,NaN,25000.0,NaN,NaT,Bangalore,1,0,True,NaN,NaN,None

In [118]:
#create a clean final dataframe containing only valid,standardized records
clean_df.info()
clean_df.head()
df

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   user_id                    0 non-null      object
 1   age                        0 non-null      float64
 2   salary                     0 non-null      float64
 3   department                 0 non-null      object
 4   join_date                  0 non-null      datetime64[ns]
 5   city                       0 non-null      object
 6   performance_score          0 non-null      object
 7   experience_years           0 non-null      object
 8   is_active                  0 non-null      object
 9   joining_year               0 non-null      float64
 10  performance_score_numeric  0 non-null      float64
 11  no_dup                     0 non-null      object
dtypes: datetime64[ns](1), float64(4), object(7)
memory usage: 0.0+ bytes

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year,performance_score_numeric,no_dup
0,USER_0,NaN,NaN,HUMAN RESOURCES,2020-12-01,New Delhi,3,<NA>,True,2020.0,NaN,None
1,U1001,30.0,45000.0,FINANCIALS,NaT,New Delhi,3,1,True,NaN,NaN,None
2,U1002,30.0,25000.0,HUMAN RESOURCES,NaT,New Delhi,excellent,10,False,NaN,NaN,None
3,NaN,NaN,NaN,HUMAN RESOURCES,NaT,Secunderabad,excellent,5,True,NaN,NaN,None
5,USER_5,NaN,25000.0,INFORMATION TECHNOLOGY,NaT,NaN,3,0,False,NaN,NaN,None
...,...,...,...,...,...,...,...,...,...,...,...,...
990,U1990,NaN,NaN,SALES,NaT,Secunderabad,NaN,<NA>,False,NaN,NaN,None
991,U1991,45.0,NaN,HUMAN RESOURCES,NaT,Mumbai City,NaN,<NA>,True,NaN,NaN,None
996,U1996,NaN,NaN,INFORMATION TECHNOLOGY,NaT,Mumbai City,NaN,5,False,NaN,NaN,None
997,USER_997,NaN,25000.0,HUMAN RESOURCES,NaT,Mumbai City,3,5,True,NaN,NaN,None
998,U1998,NaN,25000.0,NaN,NaT,Bangalore,1,0,True,NaN,NaN,None